<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TimeOut and uploads it to Jamf Pro. Appropriate testing groups are created as well as a Self Service policy.</string>
	<key>Identifier</key>
	<string>com.github.ucam-apple-support.jamf.TimeOut</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroup-update-smart-regex.xml</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>NAME</key>
		<string>TimeOut</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-install-latest.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Dejal Time Out is here to help. It will gently remind you to take a break on a regular basis.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
		<key>replace_group</key>
		<string>True</string>
		<key>replace_policy</key>
		<string>True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>uk.ac.ox.orchard.pkg.TimeOut</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%GROUP_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
